app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'Dokter'
 LIMIT 1
---
    public function login()
    {
        // Validasi form
        helper(['form']);
        $this->request->getMethod() === 'POST';
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');
            // Cek apakah username ada di database
            $user = $this->userModel->where('username', $username)->first();