app/Controllers/Patient.php

    public function searchPatient()
    {
        $norm = $this->request->getPost('norm'); // Ambil data dari AJAX

        // Cari data pasien berdasarkan norm_pasien
        $patient = $this->patientModel->where('norm_pasien', $norm)->first();
---
SELECT *
FROM `patient`
WHERE `norm_pasien` IS NULL
 LIMIT 1