app/Controllers/Users.php

    public function index()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll(); // Mengambil semua data dari tabel 'users'
        // Mengambil id_user dan nama_user dari session
        $data['id_user'] = session()->get('id_user');
        $data['nama_user'] = session()->get('nama_user');
---
SELECT *
FROM `users`