app/Models/UserModel.php

    public function insertUser($data)
    {
        // Pastikan data disimpan dengan benar
        try {
            // Proses penyimpanan data menggunakan insert
            $this->insert($data);
---
INSERT INTO `users` (`username`, `password_user`, `nama_user`, `status_user`) VALUES ('Analis', '$2y$10$yXiakVtnGXWklTTmhpPkx.QjDjn7tQ7Vai7r2.BX0msRPaqabeNQG', 'Analis', 'Analis')

    public function checkUsernameExists($username)
    {
        return $this->where('username', $username)->first(); // Cek apakah username sudah ada di database
---
SELECT *
FROM `users`
WHERE `username` = 'Analis'
 LIMIT 1